:PROPERTIES:
:ID:       61678BF7-A363-45C2-A3E2-54A1EB15EF68
:END:
#+title: brew

Homebrew is a package manager for [[id:516B3C9A-4288-4ACF-8DEE-3526DFD21083][macOS]].

At one point it seemed like brew and MacPorts were competing, but it
feels like at this point brew won out for the macOS specific title.

I use brew for many host specific installations...for anything that
may be project specific I'd probably go with nix.

#+begin_src shell
  brew --version
#+end_src

#+RESULTS:
: Homebrew 6.0.2

* Help

#+begin_src shell :results output
  brew --help
#+end_src

#+RESULTS:
#+begin_example
Example usage:
  brew search TEXT|/REGEX/
  brew info [FORMULA|CASK...]
  brew install FORMULA|CASK...
  brew update
  brew upgrade [FORMULA|CASK...]
  brew uninstall FORMULA|CASK...
  brew list [FORMULA|CASK...]

Troubleshooting:
  brew config
  brew doctor
  brew install --verbose --debug FORMULA|CASK

Contributing:
  brew create URL [--no-fetch]
  brew edit [FORMULA|CASK...]

Further help:
  brew commands
  brew help [COMMAND]
  man brew
  https://docs.brew.sh
#+end_example
